package kakaobank;
/*
        #문제 설명
        '위대한 상인' 게임에서는 n일 동안 '신비한 돌'을 사고팔아 시세 차익을 최대화해야 합니다. '신비한 돌'은 매일 시세가 달라질 수 있습니다.

        게임의 규칙은 다음과 같습니다.

        하루에 최대 하나의 돌만 살 수 있습니다.
        하루에 팔 수 있는 돌 수에는 제한이 없지만, 가지고 있는 만큼만 팔 수 있습니다.
        플레이어는 처음에 돈과 '신비한 돌'을 가지고 있지 않습니다.
        n일 중에 '신비한 돌'의 시세가 0인 날이 반드시 있습니다.
        예를 들어, 3일간 '신비한 돌'의 시세가 [0, 1, 2]라고 하겠습니다. 첫째 날 돌을 사서, 셋째 날 돌을 팔면 차익이 2로 최대가 됩니다.

        기간의 길이 n, n일 동안의 '신비한 돌'의 시세가 담긴 배열 price가 매개변수로 주어집니다. '신비한 돌'을 사고팔아 낼 수 있는 최대 차익을 return 하도록 solution 함수를 완성해주세요. 만약 차익을 낼 수 없다면 0을 return 해주세요.

        #제한사항
        n은 1 이상 100 이하인 정수입니다.
        price의 길이는 n입니다.
        price의 원소('신비한 돌'의 시세)는 0 이상 100 이하인 정수입니다.
        '신비한 돌'의 시세가 0인 날이 반드시 있습니다.
 */

public class programming3 {
    public int solution(int n, int[] price) {
        int answer = -1;
        return answer;
    }
}
